{
  "label": "axiom-guaranteed-revival",
  "statement": "The cloning score generated by a dead walker must be guaranteed to exceed the maximum possible random threshold.",
  "mathematical_expression": "\\kappa_{\\text{revival}} := \\frac{\\eta^{\\alpha+\\beta}}{\\varepsilon_{\\text{clone}} \\cdot p_{\\max}} > 1",
  "foundational_framework": "Fragile Gas Framework",
  "chapter": "1_euclidean_gas",
  "document": "01_fragile_gas_framework",
  "name": "Guaranteed Revival",
  "core_assumption": "In any swarm with at least one alive walker, the fitness potential of alive walkers is sufficiently strong relative to the cloning difficulty that dead walkers can borrow enough strength to guarantee revival with probability 1. This prevents gradual swarm extinction through individual walker attrition by ensuring that as long as a single walker survives, all dead walkers can be resurrected through the cloning mechanism.",
  "parameters": {
    "eta": {
      "name": "Rescale Lower Bound",
      "symbol": "\\eta",
      "type": "algorithmic_parameter",
      "description": "Ensures the rescaled fitness potential components are bounded away from zero. Represents the minimum 'helping power' that any alive walker possesses.",
      "constraints": "\\eta \\ge \\eta_{\\min} > 0",
      "role": "Forms the numerator's base: alive walkers have fitness potential V_fit >= eta^(alpha+beta)"
    },
    "alpha": {
      "name": "Exploitation Weight (Reward)",
      "symbol": "\\alpha",
      "type": "algorithmic_parameter",
      "description": "Controls the influence of the reward signal in the fitness potential calculation.",
      "constraints": "\\alpha \\in [0, \\infty)",
      "role": "Amplifies the rescale lower bound in the numerator, contributing to revival strength"
    },
    "beta": {
      "name": "Exploitation Weight (Diversity)",
      "symbol": "\\beta",
      "type": "algorithmic_parameter",
      "description": "Controls the influence of the diversity signal in the fitness potential calculation.",
      "constraints": "\\beta \\in [0, \\infty)",
      "role": "Amplifies the rescale lower bound in the numerator, contributing to revival strength"
    },
    "epsilon_clone": {
      "name": "Cloning Denominator Regularizer",
      "symbol": "\\varepsilon_{\\text{clone}}",
      "type": "algorithmic_parameter",
      "description": "A regularization constant in the cloning score formula that prevents division by zero and controls the sensitivity of the cloning mechanism.",
      "constraints": "\\varepsilon_{\\text{clone}} \\ge \\varepsilon_{\\text{clone},\\min} > 0",
      "role": "Forms part of the denominator, representing the mathematical difficulty of computing cloning scores"
    },
    "p_max": {
      "name": "Clone Threshold Scale",
      "symbol": "p_{\\max}",
      "type": "algorithmic_parameter",
      "description": "The upper bound of the uniformly sampled cloning threshold T_clone ~ Uniform(0, p_max). Controls the baseline responsiveness of the cloning process.",
      "constraints": "p_{\\max} > 0",
      "role": "Forms part of the denominator, representing the maximum random threshold that must be overcome for revival"
    },
    "kappa_revival": {
      "name": "Revival Score Ratio",
      "symbol": "\\kappa_{\\text{revival}}",
      "type": "axiomatic_parameter",
      "description": "The ratio of alive walker helping power to revival difficulty. Measures the robustness of the guaranteed revival mechanism.",
      "constraints": "\\kappa_{\\text{revival}} > 1",
      "role": "The primary axiomatic parameter that must exceed 1 to guarantee revival"
    }
  },
  "condition": "The axiom is satisfied if and only if kappa_revival > 1, which is equivalent to the global constraint: epsilon_clone * p_max < eta^(alpha+beta). This must hold for the entire algorithm run. The condition applies to any swarm state where at least one walker is alive (|A(S)| >= 1), ensuring that dead walkers can always select an alive companion whose fitness potential provides sufficient revival strength.",
  "failure_mode_analysis": {
    "violation_condition": "kappa_revival <= 1",
    "immediate_consequence": "When kappa_revival <= 1, the revival guarantee is broken. A dead walker's cloning score S_i is no longer guaranteed to exceed p_max, meaning there exists a non-zero probability that the randomly sampled threshold T_clone (drawn from Uniform(0, p_max)) will be larger than S_i.",
    "mechanism_of_failure": "The cloning decision is made by comparing S_i > T_clone. If S_i <= p_max, then for some threshold realizations we will have S_i <= T_clone, causing the 'Clone' action to fail and the 'Keep' action to occur instead. The dead walker remains dead rather than being revived.",
    "cascading_effects": "Individual walker deaths become permanent with positive probability. This disables the guaranteed revival mechanism, allowing the swarm to gradually shrink through attrition. Each timestep where some walkers die and fail to revive reduces the swarm size, eventually leading to complete swarm collapse (all walkers dead, the absorbing cemetery state).",
    "long_term_dynamics": "Without guaranteed revival, the swarm extinction is no longer confined to the single catastrophic event of all-walkers-dying-simultaneously. Instead, gradual attrition becomes the dominant failure mode. The system exhibits a slow, inevitable drift toward the cemetery state rather than maintaining a quasi-stationary distribution over viable swarm configurations.",
    "parameter_tradeoffs": [
      {
        "parameter": "p_max",
        "tradeoff": "Increasing p_max makes cloning more responsive (higher baseline threshold) but simultaneously makes revival harder (increases denominator of kappa_revival). There is a fundamental tension between cloning responsiveness and revival robustness."
      },
      {
        "parameter": "epsilon_clone",
        "tradeoff": "Decreasing epsilon_clone increases revival strength (decreases denominator) but may cause numerical instability in cloning score computation. Must balance revival guarantee against computational stability."
      },
      {
        "parameter": "eta",
        "tradeoff": "Increasing eta strengthens revival (increases numerator via eta^(alpha+beta)) but may reduce the dynamic range of fitness potentials, potentially flattening the fitness landscape and reducing selection pressure."
      },
      {
        "parameter": "alpha and beta",
        "tradeoff": "Increasing dynamics weights (alpha, beta) exponentially strengthens revival (eta^(alpha+beta) grows) but also exponentially amplifies measurement noise and can destabilize the standardization operator. Must balance survival against stability."
      }
    ],
    "critical_insight": "This axiom reveals that swarm viability is fundamentally a balance between selection pressure (controlled by alpha, beta, p_max) and survival guarantee (controlled by the kappa_revival ratio). The framework isolates swarm failure risk to catastrophic all-walkers-dead events rather than gradual attrition, provided this axiom is satisfied."
  },
  "source": {
    "document_id": "01_fragile_gas_framework",
    "file_path": "docs/source/1_euclidean_gas/01_fragile_gas_framework.md",
    "section": "2.1.1",
    "directive_label": "def-axiom-guaranteed-revival",
    "equation": null,
    "line_range": [583, 643],
    "url_fragment": "#axiom-of-guaranteed-revival"
  },
  "related_entities": {
    "theorems": [
      {
        "label": "thm-revival-guarantee",
        "name": "Almost-sure revival under the global constraint",
        "relationship": "This theorem proves that when the axiom is satisfied, any dead walker in a swarm with at least one alive walker has probability exactly 1 of being revived in the cloning stage.",
        "location": "01_fragile_gas_framework.md, section 2.1.1"
      }
    ],
    "definitions": [
      {
        "label": "def-companion-selection-measure",
        "name": "Companion Selection Measure",
        "relationship": "Defines how dead walkers select alive companions whose fitness potential enables revival. Critical for understanding how revival strength is computed.",
        "location": "01_fragile_gas_framework.md, section 8"
      },
      {
        "label": "def-alive-dead-sets",
        "name": "Alive and Dead Sets",
        "relationship": "Defines the partition of walkers into alive (A(S)) and dead (D(S)) sets, which determines when revival mechanisms activate.",
        "location": "01_fragile_gas_framework.md, section 1.2"
      },
      {
        "label": "def-fitness-potential-operator",
        "name": "Fitness Potential Operator",
        "relationship": "Defines V_fit, the fitness potential that provides the revival strength. The lower bound V_fit >= eta^(alpha+beta) for alive walkers is the foundation of the revival guarantee.",
        "location": "01_fragile_gas_framework.md, section 13"
      }
    ],
    "axioms": [
      {
        "label": "def-axiom-sufficient-amplification",
        "name": "Axiom of Sufficient Amplification",
        "relationship": "Requires alpha + beta > 0, ensuring the fitness potential is non-trivial. Directly impacts the numerator of kappa_revival.",
        "location": "01_fragile_gas_framework.md, section 2.1.3"
      },
      {
        "label": "def-axiom-boundary-regularity",
        "name": "Axiom of Boundary Regularity",
        "relationship": "Controls the probability of catastrophic all-walkers-dead events. Complementary to Guaranteed Revival: this axiom prevents sudden total extinction, while Guaranteed Revival prevents gradual attrition.",
        "location": "01_fragile_gas_framework.md, section 2.1.2"
      }
    ],
    "objects": [
      {
        "label": "obj-cloning-score-function",
        "name": "Cloning Score",
        "relationship": "The score S_i that must exceed the threshold T_clone for revival. Computed as S_i >= V_fit,c(i) / epsilon_clone for dead walker i with companion c(i).",
        "location": "01_fragile_gas_framework.md, section 16"
      }
    ]
  },
  "framework_role": {
    "category": "viability",
    "subcategory": "survival_mechanisms",
    "purpose": "Prevents gradual swarm extinction through individual walker attrition by guaranteeing deterministic revival of dead walkers as long as at least one walker remains alive.",
    "dependency_level": "foundational",
    "impacts": [
      "Ensures long-term swarm viability in quasi-stationary regime",
      "Isolates extinction risk to single catastrophic all-walkers-dead events",
      "Enables rigorous analysis of convergence to quasi-stationary distributions (QSD)",
      "Provides diagnostic parameter (kappa_revival) for debugging failed swarm runs"
    ]
  },
  "validation_checklist": [
    {
      "check": "Parameter bounds satisfied",
      "items": [
        "eta >= eta_min > 0",
        "alpha >= 0",
        "beta >= 0",
        "epsilon_clone >= epsilon_clone_min > 0",
        "p_max > 0"
      ]
    },
    {
      "check": "Global constraint verified",
      "items": [
        "epsilon_clone * p_max < eta^(alpha+beta)",
        "Equivalently: kappa_revival > 1"
      ]
    },
    {
      "check": "Companion selection well-defined",
      "items": [
        "For any swarm S with |A(S)| >= 1, every dead walker can select an alive companion",
        "Companion selection measure assigns positive probability to at least one alive index"
      ]
    },
    {
      "check": "Fitness potential lower bound established",
      "items": [
        "For all alive walkers j in A(S): V_fit,j >= eta^(alpha+beta)",
        "This follows from rescale function construction with floor eta"
      ]
    }
  ],
  "implementation_notes": {
    "practical_guidance": "In practice, set kappa_revival significantly above 1 (e.g., kappa_revival >= 2) to provide margin against numerical errors and edge cases. Monitor the ratio during algorithm execution; if it approaches 1, increase eta or decrease p_max * epsilon_clone.",
    "common_pitfalls": [
      "Setting p_max too large relative to eta^(alpha+beta) in pursuit of aggressive cloning behavior",
      "Forgetting that increasing dynamics weights (alpha, beta) helps revival but amplifies measurement noise",
      "Not accounting for the exponential relationship: doubling alpha doubles the exponent in eta^(alpha+beta), potentially causing overflow"
    ],
    "debugging_strategy": "If swarm gradually shrinks despite no obvious boundary violations, compute kappa_revival from current parameters. If kappa_revival <= 1 or kappa_revival ≈ 1, this axiom is likely violated or marginally satisfied."
  }
}
